interThermalPhaseFoam/tutorials/StefanPar/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    BotWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5;
        startFace       445;
    }
    FreeStream
    {
        type            patch;
        nFaces          5;
        startFace       450;
    }
    FrontNBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          500;
        startFace       455;
    }
    LeftSide
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          50;
        startFace       955;
    }
    RightSide
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          50;
        startFace       1005;
    }
)

// ************************************************************************* //
